In [4]:
import pandas as pd # 데이터 테이블, 데이터 프레임
import numpy as np # 수학, 행렬

# 1. Object creation

In [157]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [158]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [159]:
dates = pd.date_range('20130101', periods=6, freq='D')
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [160]:
# 데이터 프레임 만들기
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.770395  0.118952 -0.906067  0.585528
2013-01-02 -0.964857  0.446879 -0.021359 -1.093058
2013-01-03 -1.915192  2.225658  1.663756  1.571871
2013-01-04 -0.625043 -0.652683 -0.365439  0.085391
2013-01-05  0.438056 -1.640316  0.132424  0.321258
2013-01-06  2.229477  0.272539  0.251602 -1.508976

In [161]:
df2 = pd.DataFrame({'A':1,
                   'B': pd.Timestamp('20130102'),
                   'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                   'D': np.array([3] *4, dtype='int32'),
                   'E': pd.Categorical(["test", "train", "test", "train"]),
                   'F': 'foo'})
df2

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

# 2. Viewing data

In [162]:
df.head()

                   A         B         C         D
2013-01-01 -0.770395  0.118952 -0.906067  0.585528
2013-01-02 -0.964857  0.446879 -0.021359 -1.093058
2013-01-03 -1.915192  2.225658  1.663756  1.571871
2013-01-04 -0.625043 -0.652683 -0.365439  0.085391
2013-01-05  0.438056 -1.640316  0.132424  0.321258

In [163]:
df.tail()

                   A         B         C         D
2013-01-02 -0.964857  0.446879 -0.021359 -1.093058
2013-01-03 -1.915192  2.225658  1.663756  1.571871
2013-01-04 -0.625043 -0.652683 -0.365439  0.085391
2013-01-05  0.438056 -1.640316  0.132424  0.321258
2013-01-06  2.229477  0.272539  0.251602 -1.508976

In [164]:
df.head(6)

                   A         B         C         D
2013-01-01 -0.770395  0.118952 -0.906067  0.585528
2013-01-02 -0.964857  0.446879 -0.021359 -1.093058
2013-01-03 -1.915192  2.225658  1.663756  1.571871
2013-01-04 -0.625043 -0.652683 -0.365439  0.085391
2013-01-05  0.438056 -1.640316  0.132424  0.321258
2013-01-06  2.229477  0.272539  0.251602 -1.508976

In [165]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [166]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [167]:
df['B']

2013-01-01    0.118952
2013-01-02    0.446879
2013-01-03    2.225658
2013-01-04   -0.652683
2013-01-05   -1.640316
2013-01-06    0.272539
Freq: D, Name: B, dtype: float64

In [168]:
df.B

2013-01-01    0.118952
2013-01-02    0.446879
2013-01-03    2.225658
2013-01-04   -0.652683
2013-01-05   -1.640316
2013-01-06    0.272539
Freq: D, Name: B, dtype: float64

In [169]:
# 행렬에 Transpose > 선형대수
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.770395   -0.964857   -1.915192   -0.625043    0.438056    2.229477
B    0.118952    0.446879    2.225658   -0.652683   -1.640316    0.272539
C   -0.906067   -0.021359    1.663756   -0.365439    0.132424    0.251602
D    0.585528   -1.093058    1.571871    0.085391    0.321258   -1.508976

In [170]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.585528 -0.906067  0.118952 -0.770395
2013-01-02 -1.093058 -0.021359  0.446879 -0.964857
2013-01-03  1.571871  1.663756  2.225658 -1.915192
2013-01-04  0.085391 -0.365439 -0.652683 -0.625043
2013-01-05  0.321258  0.132424 -1.640316  0.438056
2013-01-06 -1.508976  0.251602  0.272539  2.229477

In [171]:
df.sort_values(by='B', ascending=True)

                   A         B         C         D
2013-01-05  0.438056 -1.640316  0.132424  0.321258
2013-01-04 -0.625043 -0.652683 -0.365439  0.085391
2013-01-01 -0.770395  0.118952 -0.906067  0.585528
2013-01-06  2.229477  0.272539  0.251602 -1.508976
2013-01-02 -0.964857  0.446879 -0.021359 -1.093058
2013-01-03 -1.915192  2.225658  1.663756  1.571871

# 3. Selection

## (1) Getting

In [172]:
df

                   A         B         C         D
2013-01-01 -0.770395  0.118952 -0.906067  0.585528
2013-01-02 -0.964857  0.446879 -0.021359 -1.093058
2013-01-03 -1.915192  2.225658  1.663756  1.571871
2013-01-04 -0.625043 -0.652683 -0.365439  0.085391
2013-01-05  0.438056 -1.640316  0.132424  0.321258
2013-01-06  2.229477  0.272539  0.251602 -1.508976

In [173]:
df['A']

2013-01-01   -0.770395
2013-01-02   -0.964857
2013-01-03   -1.915192
2013-01-04   -0.625043
2013-01-05    0.438056
2013-01-06    2.229477
Freq: D, Name: A, dtype: float64

In [174]:
df[df['A']>0]['A']

2013-01-05    0.438056
2013-01-06    2.229477
Freq: D, Name: A, dtype: float64

In [175]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.770395  0.118952 -0.906067  0.585528
2013-01-02 -0.964857  0.446879 -0.021359 -1.093058
2013-01-03 -1.915192  2.225658  1.663756  1.571871

In [176]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.964857  0.446879 -0.021359 -1.093058
2013-01-03 -1.915192  2.225658  1.663756  1.571871
2013-01-04 -0.625043 -0.652683 -0.365439  0.085391

## (2) Selection by label

In [177]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [178]:
df.loc['2013-01-01', 'A']

-0.7703949219804943

In [179]:
df.loc['2013-01-01':'2013-01-04', ['A', 'B']]

                   A         B
2013-01-01 -0.770395  0.118952
2013-01-02 -0.964857  0.446879
2013-01-03 -1.915192  2.225658
2013-01-04 -0.625043 -0.652683

In [180]:
df.loc[dates[0], 'A']

-0.7703949219804943

## (3) Selection by position

In [181]:
df.iloc[3]

A   -0.625043
B   -0.652683
C   -0.365439
D    0.085391
Name: 2013-01-04 00:00:00, dtype: float64

In [182]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.625043 -0.652683
2013-01-05  0.438056 -1.640316

In [183]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.964857 -0.021359
2013-01-03 -1.915192  1.663756
2013-01-05  0.438056  0.132424

In [184]:
df.iloc[1, 1]

0.44687867358461136

## (4) Boolean indexing

In [185]:
df[df['A'] >0]

                   A         B         C         D
2013-01-05  0.438056 -1.640316  0.132424  0.321258
2013-01-06  2.229477  0.272539  0.251602 -1.508976

In [186]:
df[df<0]

                   A         B         C         D
2013-01-01 -0.770395       NaN -0.906067       NaN
2013-01-02 -0.964857       NaN -0.021359 -1.093058
2013-01-03 -1.915192       NaN       NaN       NaN
2013-01-04 -0.625043 -0.652683 -0.365439       NaN
2013-01-05       NaN -1.640316       NaN       NaN
2013-01-06       NaN       NaN       NaN -1.508976

In [187]:
df2 = df.copy()

In [188]:
# 새로운 컬럼 추가하기
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [189]:
df2

                   A         B         C         D      E
2013-01-01 -0.770395  0.118952 -0.906067  0.585528    one
2013-01-02 -0.964857  0.446879 -0.021359 -1.093058    one
2013-01-03 -1.915192  2.225658  1.663756  1.571871    two
2013-01-04 -0.625043 -0.652683 -0.365439  0.085391  three
2013-01-05  0.438056 -1.640316  0.132424  0.321258   four
2013-01-06  2.229477  0.272539  0.251602 -1.508976  three

In [190]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -1.915192  2.225658  1.663756  1.571871   two
2013-01-05  0.438056 -1.640316  0.132424  0.321258  four

# Missing data

데이터 분석
1. 데이터 수집 -
2. nan, null, na -> 데이터가 빠진 부분들
    - 빈 값을 채워 넣기
    - 해당되는 행이나 열을 삭제

In [191]:
df

                   A         B         C         D
2013-01-01 -0.770395  0.118952 -0.906067  0.585528
2013-01-02 -0.964857  0.446879 -0.021359 -1.093058
2013-01-03 -1.915192  2.225658  1.663756  1.571871
2013-01-04 -0.625043 -0.652683 -0.365439  0.085391
2013-01-05  0.438056 -1.640316  0.132424  0.321258
2013-01-06  2.229477  0.272539  0.251602 -1.508976

In [192]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [193]:
df1

                   A         B         C         D   E
2013-01-01 -0.770395  0.118952 -0.906067  0.585528 NaN
2013-01-02 -0.964857  0.446879 -0.021359 -1.093058 NaN
2013-01-03 -1.915192  2.225658  1.663756  1.571871 NaN
2013-01-04 -0.625043 -0.652683 -0.365439  0.085391 NaN

In [194]:
df1.loc[dates[0]:dates[1], 'E']=1

In [195]:
df1

                   A         B         C         D    E
2013-01-01 -0.770395  0.118952 -0.906067  0.585528  1.0
2013-01-02 -0.964857  0.446879 -0.021359 -1.093058  1.0
2013-01-03 -1.915192  2.225658  1.663756  1.571871  NaN
2013-01-04 -0.625043 -0.652683 -0.365439  0.085391  NaN

In [196]:
df1.dropna(how='any')

                   A         B         C         D    E
2013-01-01 -0.770395  0.118952 -0.906067  0.585528  1.0
2013-01-02 -0.964857  0.446879 -0.021359 -1.093058  1.0

In [197]:
df1.isna()

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

In [198]:
df1.fillna(value=5)

                   A         B         C         D    E
2013-01-01 -0.770395  0.118952 -0.906067  0.585528  1.0
2013-01-02 -0.964857  0.446879 -0.021359 -1.093058  1.0
2013-01-03 -1.915192  2.225658  1.663756  1.571871  5.0
2013-01-04 -0.625043 -0.652683 -0.365439  0.085391  5.0

# 5. Operation

In [199]:
df1.mean(0)

A   -1.068872
B    0.534701
C    0.092723
D    0.287433
E    1.000000
dtype: float64

In [200]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)

In [201]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [203]:
df.sub(s, axis='index')

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02       NaN       NaN       NaN       NaN
2013-01-03 -2.915192  1.225658  0.663756  0.571871
2013-01-04 -3.625043 -3.652683 -3.365439 -2.914609
2013-01-05 -4.561944 -6.640316 -4.867576 -4.678742
2013-01-06       NaN       NaN       NaN       NaN

## (1) Apply

In [120]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -1.270646 -0.478999 -0.126200 -2.121845
2013-01-02 -1.371007 -0.669129  0.230569 -1.902682
2013-01-03 -1.770181  1.014818 -0.273480 -0.528437
2013-01-04 -1.546615 -0.279808 -0.214380 -0.608906
2013-01-05  0.089308 -1.943540 -0.665238  0.625510
2013-01-06 -0.516336 -2.022215 -1.929293  1.306447

In [122]:
df.apply(lambda x: x.max() -x.min())

A    2.906569
B    3.347679
C    1.620824
D    3.496091
dtype: float64

In [123]:
df

                   A         B         C         D
2013-01-01 -1.270646 -0.478999 -0.126200 -2.121845
2013-01-02 -0.100361 -0.190130  0.356769  0.219163
2013-01-03 -0.399175  1.683947 -0.504049  1.374245
2013-01-04  0.223566 -1.294626  0.059100 -0.080469
2013-01-05  1.635923 -1.663732 -0.450858  1.234416
2013-01-06 -0.605644 -0.078675 -1.264054  0.680937

## (2) Histogramming

In [124]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [125]:
s

0    6
1    6
2    4
3    1
4    0
5    0
6    6
7    1
8    3
9    2
dtype: int32

In [127]:
s.value_counts()

6    3
1    2
0    2
4    1
3    1
2    1
dtype: int64

# 6. Merge

## (1) Concat

In [128]:
df = pd.DataFrame(np.random.randn(10,4))

In [129]:
df

          0         1         2         3
0  1.257663  0.954857 -0.720956 -0.666764
1 -0.523911  0.046168  0.027087 -0.883682
2 -1.150174  0.473903  0.672477 -0.179484
3  1.769644 -0.727470  0.780416 -0.028167
4 -0.180487  0.674535  1.549211 -0.082635
5  0.527761  0.465491  0.558558 -0.785231
6  0.041145  0.375752 -0.071536  2.038797
7 -0.154659  0.133040 -1.213502  0.941911
8  0.573043 -0.030559  0.945989  0.487997
9 -0.928344  0.167266 -0.504352 -0.406602

In [208]:
pieces = [df[:3], df[3:7], df[7:]]

In [209]:
pieces

[                   A         B         C         D
 2013-01-01 -0.770395  0.118952 -0.906067  0.585528
 2013-01-02 -0.964857  0.446879 -0.021359 -1.093058
 2013-01-03 -1.915192  2.225658  1.663756  1.571871,
                    A         B         C         D
 2013-01-04 -0.625043 -0.652683 -0.365439  0.085391
 2013-01-05  0.438056 -1.640316  0.132424  0.321258
 2013-01-06  2.229477  0.272539  0.251602 -1.508976,
 Empty DataFrame
 Columns: [A, B, C, D]
 Index: []]

In [210]:
pd.concat(pieces)

                   A         B         C         D
2013-01-01 -0.770395  0.118952 -0.906067  0.585528
2013-01-02 -0.964857  0.446879 -0.021359 -1.093058
2013-01-03 -1.915192  2.225658  1.663756  1.571871
2013-01-04 -0.625043 -0.652683 -0.365439  0.085391
2013-01-05  0.438056 -1.640316  0.132424  0.321258
2013-01-06  2.229477  0.272539  0.251602 -1.508976

## (2) Merge

In [211]:
left = pd.DataFrame({'key':['fow', 'foo'], 'lval': [1, 2]})

In [212]:
right = pd.DataFrame({'key':['fow', 'foo'], 'rval': [4, 5]})

In [213]:
left

   key  lval
0  fow     1
1  foo     2

In [214]:
right

   key  rval
0  fow     4
1  foo     5

In [215]:
pd.merge(left, right, on='key')

   key  lval  rval
0  fow     1     4
1  foo     2     5

In [216]:
pd.merge(right, left, on='key')

   key  rval  lval
0  fow     4     1
1  foo     5     2

# 7.Grouping

## (1) groupby

In [139]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                        'foo', 'bar', 'foo', 'foo'],
                  'B': ['one', 'one', 'two', 'three',
                       'two', 'two', 'one', 'three'],
                  'C': np.random.randn(8),
                  'D': np.random.randn(8)})

In [140]:
df

     A      B         C         D
0  foo    one -1.297981  2.358585
1  bar    one  0.073965 -0.609257
2  foo    two -0.461173  0.532759
3  bar  three -1.296516  0.234914
4  foo    two  1.165681 -0.140890
5  bar    two -0.102572  1.908609
6  foo    one -1.091072  0.130598
7  foo  three  1.164128 -0.397904

In [141]:
df.groupby('A').sum()

            C         D
A
bar -1.325123  1.534266
foo -0.520418  2.483149

In [142]:
df.groupby('B').sum()

              C         D
B
one   -2.315088  1.879927
three -0.132389 -0.162990
two    0.601936  2.300478

In [144]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one    0.073965 -0.609257
    three -1.296516  0.234914
    two   -0.102572  1.908609
foo one   -2.389054  2.489184
    three  1.164128 -0.397904
    two    0.704508  0.391869

# 8. Pivot tables

In [146]:
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three']*3,
                  'B': ['A', 'B', 'C']*4,
                  'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar']*2,
                  'D': np.random.randn(12),
                  'E': np.random.randn(12)})

In [147]:
df

        A  B    C         D         E
0     one  A  foo  0.367726  0.878314
1     one  B  foo -1.068383 -1.655192
2     two  C  foo  0.084561 -1.299636
3   three  A  bar  0.639883  0.434837
4     one  B  bar -0.312156  0.529166
5     one  C  bar -0.356304  0.303135
6     two  A  foo  0.683512 -1.224483
7   three  B  foo -0.946637  1.213313
8     one  C  foo  1.153011  1.494539
9     one  A  bar  0.740009 -1.701883
10    two  B  bar  0.153307  0.326427
11  three  C  bar -0.648439 -1.035738

In [149]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  0.740009  0.367726
      B -0.312156 -1.068383
      C -0.356304  1.153011
three A  0.639883       NaN
      B       NaN -0.946637
      C -0.648439       NaN
two   A       NaN  0.683512
      B  0.153307       NaN
      C       NaN  0.084561